# PointCloudFilterUtils Methods

---
The PointCloudFilterUtils type exposes the following members.
| Name| Description
---|---|---
| GetFilteredOutline|  Computes outline of a part of a box that satisfies given PointCloudFilter.
Top
#### Reference
PointCloudFilterUtils Class
Autodesk.Revit.DB.PointClouds Namespace